; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=360, out_folder=./training, instance_id=80, seed=2104, goal_proportion=0.03

(define (problem blocksworld-80)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 b262 b263 b264 b265 b266 b267 b268 b269 b270 b271 b272 b273 b274 b275 b276 b277 b278 b279 b280 b281 b282 b283 b284 b285 b286 b287 b288 b289 b290 b291 b292 b293 b294 b295 b296 b297 b298 b299 b300 b301 b302 b303 b304 b305 b306 b307 b308 b309 b310 b311 b312 b313 b314 b315 b316 b317 b318 b319 b320 b321 b322 b323 b324 b325 b326 b327 b328 b329 b330 b331 b332 b333 b334 b335 b336 b337 b338 b339 b340 b341 b342 b343 b344 b345 b346 b347 b348 b349 b350 b351 b352 b353 b354 b355 b356 b357 b358 b359 b360 - object)
 (:init 
    (arm-empty)
    (clear b1)
    (on-table b1)
    (clear b21)
    (on b21 b166)
    (on-table b166)
    (clear b199)
    (on-table b199)
    (clear b224)
    (on b224 b114)
    (on b114 b267)
    (on b267 b196)
    (on-table b196)
    (clear b91)
    (on b91 b352)
    (on b352 b306)
    (on b306 b49)
    (on b49 b81)
    (on b81 b56)
    (on b56 b55)
    (on-table b55)
    (clear b144)
    (on b144 b158)
    (on b158 b170)
    (on-table b170)
    (clear b117)
    (on b117 b155)
    (on-table b155)
    (clear b8)
    (on b8 b48)
    (on b48 b345)
    (on b345 b87)
    (on-table b87)
    (clear b11)
    (on b11 b147)
    (on-table b147)
    (clear b355)
    (on b355 b128)
    (on b128 b29)
    (on b29 b281)
    (on b281 b107)
    (on b107 b35)
    (on b35 b236)
    (on b236 b168)
    (on b168 b141)
    (on b141 b176)
    (on-table b176)
    (clear b169)
    (on b169 b266)
    (on b266 b265)
    (on-table b265)
    (clear b113)
    (on b113 b64)
    (on b64 b319)
    (on b319 b165)
    (on b165 b347)
    (on b347 b181)
    (on-table b181)
    (clear b263)
    (on b263 b230)
    (on b230 b332)
    (on b332 b93)
    (on b93 b84)
    (on b84 b14)
    (on b14 b90)
    (on b90 b28)
    (on-table b28)
    (clear b123)
    (on b123 b20)
    (on b20 b143)
    (on-table b143)
    (clear b157)
    (on b157 b349)
    (on b349 b75)
    (on b75 b255)
    (on b255 b270)
    (on-table b270)
    (clear b201)
    (on-table b201)
    (clear b160)
    (on b160 b314)
    (on b314 b328)
    (on b328 b52)
    (on b52 b198)
    (on b198 b92)
    (on b92 b205)
    (on b205 b300)
    (on b300 b32)
    (on b32 b136)
    (on b136 b97)
    (on b97 b59)
    (on b59 b65)
    (on b65 b73)
    (on b73 b346)
    (on b346 b63)
    (on b63 b142)
    (on-table b142)
    (clear b250)
    (on b250 b268)
    (on b268 b289)
    (on b289 b197)
    (on b197 b39)
    (on b39 b156)
    (on b156 b189)
    (on-table b189)
    (clear b185)
    (on b185 b19)
    (on b19 b138)
    (on b138 b17)
    (on b17 b119)
    (on-table b119)
    (clear b341)
    (on b341 b22)
    (on b22 b43)
    (on b43 b78)
    (on-table b78)
    (clear b124)
    (on b124 b127)
    (on b127 b247)
    (on-table b247)
    (clear b134)
    (on-table b134)
    (clear b23)
    (on b23 b67)
    (on b67 b233)
    (on-table b233)
    (clear b10)
    (on b10 b286)
    (on-table b286)
    (clear b112)
    (on-table b112)
    (clear b118)
    (on-table b118)
    (clear b275)
    (on b275 b31)
    (on b31 b331)
    (on b331 b46)
    (on b46 b219)
    (on-table b219)
    (clear b152)
    (on b152 b62)
    (on b62 b317)
    (on-table b317)
    (clear b292)
    (on b292 b61)
    (on-table b61)
    (clear b294)
    (on b294 b194)
    (on b194 b264)
    (on b264 b188)
    (on-table b188)
    (clear b104)
    (on-table b104)
    (clear b216)
    (on b216 b273)
    (on-table b273)
    (clear b226)
    (on b226 b57)
    (on b57 b200)
    (on b200 b125)
    (on b125 b122)
    (on b122 b111)
    (on-table b111)
    (clear b308)
    (on b308 b251)
    (on-table b251)
    (clear b131)
    (on b131 b4)
    (on b4 b326)
    (on b326 b242)
    (on b242 b222)
    (on b222 b337)
    (on b337 b41)
    (on b41 b88)
    (on b88 b161)
    (on b161 b351)
    (on-table b351)
    (clear b47)
    (on b47 b150)
    (on-table b150)
    (clear b274)
    (on-table b274)
    (clear b217)
    (on b217 b320)
    (on b320 b167)
    (on b167 b353)
    (on b353 b318)
    (on b318 b148)
    (on-table b148)
    (clear b126)
    (on b126 b356)
    (on b356 b235)
    (on b235 b50)
    (on b50 b248)
    (on-table b248)
    (clear b6)
    (on b6 b310)
    (on-table b310)
    (clear b38)
    (on b38 b101)
    (on-table b101)
    (clear b76)
    (on b76 b195)
    (on b195 b240)
    (on-table b240)
    (clear b329)
    (on b329 b304)
    (on b304 b290)
    (on b290 b187)
    (on b187 b95)
    (on b95 b60)
    (on b60 b338)
    (on b338 b325)
    (on b325 b231)
    (on b231 b225)
    (on b225 b184)
    (on b184 b282)
    (on-table b282)
    (clear b360)
    (on b360 b163)
    (on b163 b66)
    (on b66 b42)
    (on-table b42)
    (clear b305)
    (on b305 b227)
    (on b227 b354)
    (on-table b354)
    (clear b179)
    (on b179 b288)
    (on b288 b243)
    (on-table b243)
    (clear b37)
    (on-table b37)
    (clear b214)
    (on b214 b174)
    (on-table b174)
    (clear b291)
    (on b291 b271)
    (on-table b271)
    (clear b244)
    (on b244 b229)
    (on b229 b348)
    (on b348 b110)
    (on b110 b254)
    (on b254 b71)
    (on b71 b15)
    (on b15 b256)
    (on b256 b208)
    (on b208 b203)
    (on b203 b159)
    (on b159 b202)
    (on b202 b121)
    (on b121 b193)
    (on b193 b259)
    (on b259 b3)
    (on b3 b212)
    (on-table b212)
    (clear b237)
    (on b237 b257)
    (on-table b257)
    (clear b98)
    (on b98 b139)
    (on b139 b109)
    (on b109 b30)
    (on b30 b220)
    (on b220 b13)
    (on b13 b177)
    (on b177 b245)
    (on b245 b278)
    (on b278 b210)
    (on b210 b77)
    (on b77 b293)
    (on-table b293)
    (clear b79)
    (on-table b79)
    (clear b12)
    (on-table b12)
    (clear b26)
    (on b26 b213)
    (on-table b213)
    (clear b327)
    (on b327 b298)
    (on b298 b343)
    (on b343 b108)
    (on b108 b336)
    (on b336 b51)
    (on b51 b322)
    (on-table b322)
    (clear b34)
    (on b34 b102)
    (on b102 b211)
    (on b211 b297)
    (on-table b297)
    (clear b25)
    (on b25 b324)
    (on b324 b18)
    (on b18 b261)
    (on b261 b262)
    (on-table b262)
    (clear b335)
    (on b335 b53)
    (on b53 b172)
    (on-table b172)
    (clear b86)
    (on b86 b135)
    (on-table b135)
    (clear b260)
    (on b260 b146)
    (on b146 b132)
    (on b132 b175)
    (on b175 b145)
    (on-table b145)
    (clear b239)
    (on b239 b151)
    (on b151 b241)
    (on b241 b70)
    (on b70 b171)
    (on b171 b129)
    (on b129 b130)
    (on b130 b58)
    (on b58 b238)
    (on b238 b191)
    (on b191 b358)
    (on b358 b359)
    (on b359 b296)
    (on b296 b276)
    (on b276 b323)
    (on b323 b27)
    (on b27 b69)
    (on-table b69)
    (clear b33)
    (on-table b33)
    (clear b279)
    (on b279 b232)
    (on b232 b299)
    (on b299 b82)
    (on b82 b137)
    (on b137 b192)
    (on b192 b218)
    (on b218 b307)
    (on b307 b340)
    (on b340 b16)
    (on-table b16)
    (clear b342)
    (on-table b342)
    (clear b2)
    (on b2 b5)
    (on-table b5)
    (clear b36)
    (on b36 b100)
    (on b100 b316)
    (on b316 b272)
    (on b272 b206)
    (on b206 b258)
    (on b258 b334)
    (on b334 b190)
    (on b190 b99)
    (on-table b99)
    (clear b204)
    (on b204 b252)
    (on b252 b285)
    (on b285 b301)
    (on b301 b313)
    (on b313 b173)
    (on b173 b120)
    (on b120 b9)
    (on b9 b115)
    (on b115 b315)
    (on b315 b68)
    (on-table b68)
    (clear b277)
    (on b277 b344)
    (on-table b344)
    (clear b103)
    (on-table b103)
    (clear b106)
    (on b106 b333)
    (on b333 b357)
    (on b357 b311)
    (on-table b311)
    (clear b215)
    (on-table b215)
    (clear b44)
    (on b44 b96)
    (on b96 b280)
    (on b280 b295)
    (on b295 b246)
    (on b246 b45)
    (on b45 b149)
    (on b149 b24)
    (on b24 b162)
    (on b162 b234)
    (on-table b234)
    (clear b309)
    (on b309 b72)
    (on b72 b183)
    (on b183 b164)
    (on-table b164)
    (clear b153)
    (on b153 b303)
    (on b303 b85)
    (on b85 b321)
    (on b321 b80)
    (on-table b80)
    (clear b223)
    (on b223 b209)
    (on b209 b180)
    (on b180 b186)
    (on b186 b312)
    (on-table b312)
    (clear b284)
    (on b284 b302)
    (on b302 b133)
    (on b133 b116)
    (on-table b116)
    (clear b140)
    (on-table b140)
    (clear b228)
    (on b228 b40)
    (on b40 b54)
    (on-table b54)
    (clear b350)
    (on b350 b7)
    (on b7 b339)
    (on b339 b154)
    (on b154 b253)
    (on-table b253)
    (clear b178)
    (on b178 b83)
    (on b83 b74)
    (on b74 b221)
    (on b221 b89)
    (on-table b89)
    (clear b283)
    (on b283 b287)
    (on b287 b182)
    (on b182 b330)
    (on-table b330)
    (clear b207)
    (on b207 b249)
    (on-table b249)
    (clear b105)
    (on b105 b269)
    (on b269 b94)
    (on-table b94))
 (:goal  (and 
    (clear b3)
    (on b3 b7)
    (on-table b7)
    (clear b6)
    (on b6 b2)
    (on-table b2)
    (clear b8)
    (on b8 b1)
    (on-table b1)
    (clear b10)
    (on b10 b9)
    (on b9 b4)
    (on b4 b5)
    (on-table b5))))

; plan
1. (unstack b2 b5)
   deleted: (on b2 b5) (clear b2) (arm-empty)
   added: (holding b2) (clear b5)
   goals met: 5 of 14
2. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 6 of 14
3. (unstack b131 b4)
   deleted: (on b131 b4) (clear b131) (arm-empty)
   added: (holding b131) (clear b4)
   goals met: 6 of 14
4. (putdown b131)
   deleted: (holding b131)
   added: (clear b131) (arm-empty) (on-table b131)
   goals met: 6 of 14
5. (unstack b204 b252)
   deleted: (on b204 b252) (clear b204) (arm-empty)
   added: (holding b204) (clear b252)
   goals met: 6 of 14
6. (putdown b204)
   deleted: (holding b204)
   added: (clear b204) (arm-empty) (on-table b204)
   goals met: 6 of 14
7. (unstack b244 b229)
   deleted: (on b244 b229) (clear b244) (arm-empty)
   added: (holding b244) (clear b229)
   goals met: 6 of 14
8. (putdown b244)
   deleted: (holding b244)
   added: (clear b244) (arm-empty) (on-table b244)
   goals met: 6 of 14
9. (unstack b229 b348)
   deleted: (on b229 b348) (clear b229) (arm-empty)
   added: (holding b229) (clear b348)
   goals met: 6 of 14
10. (putdown b229)
   deleted: (holding b229)
   added: (clear b229) (arm-empty) (on-table b229)
   goals met: 6 of 14
11. (unstack b252 b285)
   deleted: (on b252 b285) (clear b252) (arm-empty)
   added: (holding b252) (clear b285)
   goals met: 6 of 14
12. (putdown b252)
   deleted: (holding b252)
   added: (clear b252) (arm-empty) (on-table b252)
   goals met: 6 of 14
13. (unstack b285 b301)
   deleted: (on b285 b301) (clear b285) (arm-empty)
   added: (holding b285) (clear b301)
   goals met: 6 of 14
14. (putdown b285)
   deleted: (holding b285)
   added: (clear b285) (arm-empty) (on-table b285)
   goals met: 6 of 14
15. (unstack b301 b313)
   deleted: (on b301 b313) (clear b301) (arm-empty)
   added: (holding b301) (clear b313)
   goals met: 6 of 14
16. (putdown b301)
   deleted: (holding b301)
   added: (clear b301) (arm-empty) (on-table b301)
   goals met: 6 of 14
17. (unstack b313 b173)
   deleted: (on b313 b173) (clear b313) (arm-empty)
   added: (holding b313) (clear b173)
   goals met: 6 of 14
18. (putdown b313)
   deleted: (holding b313)
   added: (clear b313) (arm-empty) (on-table b313)
   goals met: 6 of 14
19. (unstack b173 b120)
   deleted: (on b173 b120) (clear b173) (arm-empty)
   added: (holding b173) (clear b120)
   goals met: 6 of 14
20. (putdown b173)
   deleted: (holding b173)
   added: (clear b173) (arm-empty) (on-table b173)
   goals met: 6 of 14
21. (unstack b120 b9)
   deleted: (on b120 b9) (clear b120) (arm-empty)
   added: (holding b120) (clear b9)
   goals met: 6 of 14
22. (putdown b120)
   deleted: (holding b120)
   added: (clear b120) (arm-empty) (on-table b120)
   goals met: 6 of 14
23. (unstack b348 b110)
   deleted: (on b348 b110) (clear b348) (arm-empty)
   added: (holding b348) (clear b110)
   goals met: 6 of 14
24. (putdown b348)
   deleted: (holding b348)
   added: (clear b348) (arm-empty) (on-table b348)
   goals met: 6 of 14
25. (unstack b110 b254)
   deleted: (on b110 b254) (clear b110) (arm-empty)
   added: (holding b110) (clear b254)
   goals met: 6 of 14
26. (putdown b110)
   deleted: (holding b110)
   added: (clear b110) (arm-empty) (on-table b110)
   goals met: 6 of 14
27. (unstack b254 b71)
   deleted: (on b254 b71) (clear b254) (arm-empty)
   added: (holding b254) (clear b71)
   goals met: 6 of 14
28. (putdown b254)
   deleted: (holding b254)
   added: (clear b254) (arm-empty) (on-table b254)
   goals met: 6 of 14
29. (unstack b350 b7)
   deleted: (on b350 b7) (clear b350) (arm-empty)
   added: (holding b350) (clear b7)
   goals met: 6 of 14
30. (putdown b350)
   deleted: (holding b350)
   added: (clear b350) (arm-empty) (on-table b350)
   goals met: 6 of 14
31. (unstack b7 b339)
   deleted: (on b7 b339) (clear b7) (arm-empty)
   added: (holding b7) (clear b339)
   goals met: 6 of 14
32. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 7 of 14
33. (unstack b71 b15)
   deleted: (on b71 b15) (clear b71) (arm-empty)
   added: (holding b71) (clear b15)
   goals met: 7 of 14
34. (putdown b71)
   deleted: (holding b71)
   added: (clear b71) (arm-empty) (on-table b71)
   goals met: 7 of 14
35. (unstack b15 b256)
   deleted: (on b15 b256) (clear b15) (arm-empty)
   added: (holding b15) (clear b256)
   goals met: 7 of 14
36. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 7 of 14
37. (unstack b256 b208)
   deleted: (on b256 b208) (clear b256) (arm-empty)
   added: (holding b256) (clear b208)
   goals met: 7 of 14
38. (putdown b256)
   deleted: (holding b256)
   added: (clear b256) (arm-empty) (on-table b256)
   goals met: 7 of 14
39. (unstack b208 b203)
   deleted: (on b208 b203) (clear b208) (arm-empty)
   added: (holding b208) (clear b203)
   goals met: 7 of 14
40. (putdown b208)
   deleted: (holding b208)
   added: (clear b208) (arm-empty) (on-table b208)
   goals met: 7 of 14
41. (unstack b203 b159)
   deleted: (on b203 b159) (clear b203) (arm-empty)
   added: (holding b203) (clear b159)
   goals met: 7 of 14
42. (putdown b203)
   deleted: (holding b203)
   added: (clear b203) (arm-empty) (on-table b203)
   goals met: 7 of 14
43. (unstack b159 b202)
   deleted: (on b159 b202) (clear b159) (arm-empty)
   added: (holding b159) (clear b202)
   goals met: 7 of 14
44. (putdown b159)
   deleted: (holding b159)
   added: (clear b159) (arm-empty) (on-table b159)
   goals met: 7 of 14
45. (unstack b202 b121)
   deleted: (on b202 b121) (clear b202) (arm-empty)
   added: (holding b202) (clear b121)
   goals met: 7 of 14
46. (putdown b202)
   deleted: (holding b202)
   added: (clear b202) (arm-empty) (on-table b202)
   goals met: 7 of 14
47. (unstack b121 b193)
   deleted: (on b121 b193) (clear b121) (arm-empty)
   added: (holding b121) (clear b193)
   goals met: 7 of 14
48. (putdown b121)
   deleted: (holding b121)
   added: (clear b121) (arm-empty) (on-table b121)
   goals met: 7 of 14
49. (unstack b193 b259)
   deleted: (on b193 b259) (clear b193) (arm-empty)
   added: (holding b193) (clear b259)
   goals met: 7 of 14
50. (putdown b193)
   deleted: (holding b193)
   added: (clear b193) (arm-empty) (on-table b193)
   goals met: 7 of 14
51. (unstack b259 b3)
   deleted: (on b259 b3) (clear b259) (arm-empty)
   added: (holding b259) (clear b3)
   goals met: 8 of 14
52. (putdown b259)
   deleted: (holding b259)
   added: (clear b259) (arm-empty) (on-table b259)
   goals met: 8 of 14
53. (unstack b4 b326)
   deleted: (on b4 b326) (clear b4) (arm-empty)
   added: (holding b4) (clear b326)
   goals met: 8 of 14
54. (stack b4 b5)
   deleted: (clear b5) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b5)
   goals met: 9 of 14
55. (unstack b9 b115)
   deleted: (on b9 b115) (clear b9) (arm-empty)
   added: (holding b9) (clear b115)
   goals met: 9 of 14
56. (stack b9 b4)
   deleted: (clear b4) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b4)
   goals met: 10 of 14
57. (unstack b10 b286)
   deleted: (on b10 b286) (clear b10) (arm-empty)
   added: (holding b10) (clear b286)
   goals met: 9 of 14
58. (stack b10 b9)
   deleted: (clear b9) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b9)
   goals met: 11 of 14
59. (unstack b3 b212)
   deleted: (on b3 b212) (clear b3) (arm-empty)
   added: (holding b3) (clear b212)
   goals met: 10 of 14
60. (stack b3 b7)
   deleted: (clear b7) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b7)
   goals met: 12 of 14
61. (unstack b6 b310)
   deleted: (on b6 b310) (clear b6) (arm-empty)
   added: (holding b6) (clear b310)
   goals met: 11 of 14
62. (stack b6 b2)
   deleted: (clear b2) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b2)
   goals met: 13 of 14
63. (unstack b8 b48)
   deleted: (on b8 b48) (clear b8) (arm-empty)
   added: (holding b8) (clear b48)
   goals met: 12 of 14
64. (stack b8 b1)
   deleted: (clear b1) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b1)
   goals met: 14 of 14
